jasonkajita/pic32-part-support/include/proc/p32mx450f256hb.h
#define _U4MODE_PDSEL0_POSITION                  0x00000001
#define _U4MODE_PDSEL0_MASK                      0x00000002
#define _U4MODE_PDSEL0_LENGTH                    0x00000001

#define _U4MODE_PDSEL1_POSITION                  0x00000002
#define _U4MODE_PDSEL1_MASK                      0x00000004
#define _U4MODE_PDSEL1_LENGTH                    0x00000001

#define _U4MODE_UEN0_POSITION                    0x00000008
#define _U4MODE_UEN0_MASK                        0x00000100
#define _U4MODE_UEN0_LENGTH                      0x00000001

#define _U4MODE_UEN1_POSITION                    0x00000009
#define _U4MODE_UEN1_MASK                        0x00000200
#define _U4MODE_UEN1_LENGTH                      0x00000001

#define _U4MODE_USIDL_POSITION                   0x0000000D
#define _U4MODE_USIDL_MASK                       0x00002000
#define _U4MODE_USIDL_LENGTH                     0x00000001

#define _U4MODE_UARTEN_POSITION                  0x0000000F
#define _U4MODE_UARTEN_MASK                      0x00008000
#define _U4MODE_UARTEN_LENGTH                    0x00000001

#define _U4MODE_w_POSITION                       0x00000000
#define _U4MODE_w_MASK                           0xFFFFFFFF
#define _U4MODE_w_LENGTH                         0x00000020

#define _UodMODE_STSEL_POSITION                  0x00000000
#define _UodMODE_STSEL_MASK                      0x00000001
#define _UodMODE_STSEL_LENGTH                    0x00000001

#define _UodMODE_PDSEL_POSITION                  0x00000001
#define _UodMODE_PDSEL_MASK                      0x00000006
#define _UodMODE_PDSEL_LENGTH                    0x00000002

#define _UodMODE_BRGH_POSITION                   0x00000003
#define _UodMODE_BRGH_MASK                       0x00000008
#define _UodMODE_BRGH_LENGTH                     0x00000001

#define _UodMODE_RXINV_POSITION                  0x00000004
#define _UodMODE_RXINV_MASK                      0x00000010
#define _UodMODE_RXINV_LENGTH                    0x00000001

#define _UodMODE_ABAUD_POSITION                  0x00000005
#define _UodMODE_ABAUD_MASK                      0x00000020
#define _UodMODE_ABAUD_LENGTH                    0x00000001

#define _UodMODE_LPBACK_POSITION                 0x00000006
#define _UodMODE_LPBACK_MASK                     0x00000040
#define _UodMODE_LPBACK_LENGTH                   0x00000001

#define _UodMODE_WAKE_POSITION                   0x00000007
#define _UodMODE_WAKE_MASK                       0x00000080
#define _UodMODE_WAKE_LENGTH                     0x00000001

#define _UodMODE_UEN_POSITION                    0x00000008
#define _UodMODE_UEN_MASK                        0x00000300
#define _UodMODE_UEN_LENGTH                      0x00000002

#define _UodMODE_RTSMD_POSITION                  0x0000000B
#define _UodMODE_RTSMD_MASK                      0x00000800
#define _UodMODE_RTSMD_LENGTH                    0x00000001

#define _UodMODE_IREN_POSITION                   0x0000000C
#define _UodMODE_IREN_MASK                       0x00001000
#define _UodMODE_IREN_LENGTH                     0x00000001

#define _UodMODE_SIDL_POSITION                   0x0000000D
#define _UodMODE_SIDL_MASK                       0x00002000
#define _UodMODE_SIDL_LENGTH                     0x00000001

#define _UodMODE_ON_POSITION                     0x0000000F
#define _UodMODE_ON_MASK                         0x00008000
#define _UodMODE_ON_LENGTH                       0x00000001

#define _UodMODE_PDSEL0_POSITION                 0x00000001
#define _UodMODE_PDSEL0_MASK                     0x00000002
#define _UodMODE_PDSEL0_LENGTH                   0x00000001

#define _UodMODE_PDSEL1_POSITION                 0x00000002
#define _UodMODE_PDSEL1_MASK                     0x00000004
#define _UodMODE_PDSEL1_LENGTH                   0x00000001

#define _UodMODE_UEN0_POSITION                   0x00000008
#define _UodMODE_UEN0_MASK                       0x00000100
#define _UodMODE_UEN0_LENGTH                     0x00000001

#define _UodMODE_UEN1_POSITION                   0x00000009
#define _UodMODE_UEN1_MASK                       0x00000200
#define _UodMODE_UEN1_LENGTH                     0x00000001

#define _UodMODE_USIDL_POSITION                  0x0000000D
#define _UodMODE_USIDL_MASK                      0x00002000
#define _UodMODE_USIDL_LENGTH                    0x00000001

#define _UodMODE_UARTEN_POSITION                 0x0000000F
#define _UodMODE_UARTEN_MASK                     0x00008000
#define _UodMODE_UARTEN_LENGTH                   0x00000001

#define _UodMODE_w_POSITION                      0x00000000
#define _UodMODE_w_MASK                          0xFFFFFFFF
#define _UodMODE_w_LENGTH                        0x00000020

#define _U4STA_URXDA_POSITION                    0x00000000
#define _U4STA_URXDA_MASK                        0x00000001
#define _U4STA_URXDA_LENGTH                      0x00000001

#define _U4STA_OERR_POSITION                     0x00000001
#define _U4STA_OERR_MASK                         0x00000002
#define _U4STA_OERR_LENGTH                       0x00000001

#define _U4STA_FERR_POSITION                     0x00000002
#define _U4STA_FERR_MASK                         0x00000004
#define _U4STA_FERR_LENGTH                       0x00000001

#define _U4STA_PERR_POSITION                     0x00000003
#define _U4STA_PERR_MASK                         0x00000008
#define _U4STA_PERR_LENGTH                       0x00000001

#define _U4STA_RIDLE_POSITION                    0x00000004
#define _U4STA_RIDLE_MASK                        0x00000010
#define _U4STA_RIDLE_LENGTH                      0x00000001

#define _U4STA_ADDEN_POSITION                    0x00000005
#define _U4STA_ADDEN_MASK                        0x00000020
#define _U4STA_ADDEN_LENGTH                      0x00000001

#define _U4STA_URXISEL_POSITION                  0x00000006
#define _U4STA_URXISEL_MASK                      0x000000C0
#define _U4STA_URXISEL_LENGTH                    0x00000002

#define _U4STA_TRMT_POSITION                     0x00000008
#define _U4STA_TRMT_MASK                         0x00000100
#define _U4STA_TRMT_LENGTH                       0x00000001

#define _U4STA_UTXBF_POSITION                    0x00000009
#define _U4STA_UTXBF_MASK                        0x00000200
#define _U4STA_UTXBF_LENGTH                      0x00000001

